JiaZi = {
    "甲子": {
        "上元": ["甲子", "乙丑", "丙寅", "丁卯", "戊辰"],
        "中元": ["己巳", "庚午", "辛未", "壬申", "癸酉"],
        "空亡": ["戌", "亥"],
        "遁": "戊",
    },
    "甲戌": {
        "下元": ["甲戌", "乙亥", "丙子", "丁丑", "戊寅"],
        "上元": ["己卯", "庚辰", "辛巳", "壬午", "癸未"],
        "空亡": ["申", "酉"],
        "遁": "己",
    },
    "甲申": {
        "中元": ["甲申", "乙酉", "丙戌", "丁亥", "戊子"],
        "下元": ["己丑", "庚寅", "辛卯", "壬辰", "癸巳"],
        "空亡": ["午", "未"],
        "遁": "庚",
    },
    "甲午": {
        "上元": ["甲午", "乙未", "丙申", "丁酉", "戊戌"],
        "中元": ["己亥", "庚子", "辛丑", "壬寅", "癸卯"],
        "空亡": ["辰", "巳"],
        "遁": "辛",
    },
    "甲辰": {
        "下元": ["甲辰", "乙巳", "丙午", "丁未", "戊申"],
        "上元": ["己酉", "庚戌", "辛亥", "壬子", "癸丑"],
        "空亡": ["寅", "卯"],
        "遁": "壬",
    },
    "甲寅": {
        "中元": ["甲寅", "乙卯", "丙辰", "丁巳", "戊午"],
        "下元": ["己未", "庚申", "辛酉", "壬戌", "癸亥"],
        "空亡": ["子", "丑"],
        "遁": "癸",
    },
}
